using System.Collections.Generic;

namespace TrelloClone.Models.Mailing
{
    public static class Mailing
    {
        public static List<string> GetMails()
        {
            return new List<string>
        {
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Заполните, пожалуйста, " +
                "<b>SMART-задачи на следующий квартал. </b>" + 
                "<span>Заполнение SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" + 
                    "<br>" + 
                    "<div>или через ярлык на рабочем столе <div>" + 
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас заполнить список задач" +
                "<b> с 20 по 24 число текущего месяца </b>" +
                "и направить их на согласование непосредственному руководителю, нажав на кнопку " +
                "<b>«На согласование».</b>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Напоминаем о необходимости заполнить " +
                "<b>SMART-задачи на следующий квартал. </b>" +
                "<span>Заполнение SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +            

            "<div>" +
                "Просим Вас заполнить список задач" +
                "<b> с 20 по 24 число текущего месяца </b>" +
                "и направить их на согласование непосредственному руководителю, нажав на кнопку" +
                "<b> «На согласование».</b>" +
            "</div>" +

            "<br>" +

            "<div>" +
                "Если не нажать на кнопку «На согласование» по 24 число включительно, " +
                "то 25 числа задачи будут автоматически отправлены на согласование Вашему непосредственному руководителю." +
            "</div>" +

            "<br>" +

            "<div>" +
                "Создание новых задач возможно в течение отчетного квартала, " +
                "изменение уже созданных задач возможно до получения оценочного суждения по задаче от непосредственного руководителя. " +
            "</div>" +

            "<br>" +

            "<div>" +
                "<i> *Если Вы уже произвели самооценку, проигнорируйте это письмо. </i>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Согласуйте, пожалуйста, " +
                "<b>SMART-задачи Ваших работников на следующий квартал. </b>" +
                "<span>Согласование SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас согласовать задачи Ваших работников" +
                "<b> по последний день текущего месяца.</b>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Напоминаем о необходимости согласовать " +
                "<b>SMART-задачи Ваших работников на следующий квартал. </b>" +
                "<span>Согласование SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас согласовать задачи Ваших работников" +
                "<b> по последний день текущего месяца.</b>" +              
            "</div>" +

            "<br>" +

             "<div>" +
                "При отсутствии Вашего согласования 1 числа отчётного квартала задачи автоматически перейдут" +
                " на этап «SMART-задачи к исполнению»." +
            "</div>" +

            "<br>" +

            "<div>" +
                "Создание новых задач возможно в течение отчетного квартала, " +
                " изменение уже созданных задач возможно до проставления Вами оценочного суждения по задаче." +
            "</div>" +

            "<br>" +

            "<div>" +
                "<i> *Если Вы уже произвели самооценку, проигнорируйте это письмо. </i>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////


             ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Пришло время подвести " +
                "<b>итоги реализации SMART-задач за отчетный квартал. </b>" +
                "<span>Заполнение результатов SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас заполнить оценочные суждения по задачам" +
                "<b> по 7 число текущего месяца </b>" +
                "и направить их на согласование непосредственному руководителю."
                +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////


            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Напоминаем о необходимости подвести " +
                "<b> итоги реализации SMART-задач за отчетный квартал. </b>" +
                "<span>Заполнение результатов SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас заполнить оценочные суждения по задачам " +
                "<b> по 7 число текущего месяца </b>" +
                "и направить их на согласование непосредственному руководителю." +
            "</div>" +

            "<br>" +

             "<div>" +
                "Если оценочные суждения по задачам не будут заполнены по 7 число включительно, " +
                "то Вашему непосредственному руководителю будут отправлены на согласование задачи без Ваших оценочных суждений." +
            "</div>" +

            "<br>" +

            "<div>" +
                "<i> *Если Вы уже произвели самооценку, проигнорируйте это письмо. </i>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Пришло время подвести " +
                "<b>итоги реализации SMART-задач Ваших работников за отчетный квартал. </b>" +
                "<span>Согласование результатов SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас согласовать оценочные суждения по задачам Ваших работников" +
                "<b> по 14 число текущего месяца.</b>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Напоминаем о необходимости подвести " +
                "<b>итоги реализации SMART-задач Ваших работников за отчетный квартал. </b>" +
                "<span>Согласование результатов  SMART-задач доступно по ссылке </span>" +

                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">https://10.117.11.77:44370/Account/LogOut <a/>" +
                    "<br>" +
                    "<div>или через ярлык на рабочем столе <div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +

            "</div>" +

            "<br>" +

            "<div>" +
                "Просим Вас оценить выполнение задач Ваших работников " +
                "<b> по 14 число текущего месяца, </b>" +
                "проставив оценочные суждения." +
            "</div>" +

            "<br>" +

            "<div>" +
                "<b> При отсутствии </b>" +
                "Вашей оценки по задачам по 14 число включительно " +
                "выплата премии работнику переносится на следующий месяц." +
            "</div>" +

            "<br>" +

            "<div>" +
                "<i> *Если Вы уже произвели самооценку, проигнорируйте это письмо. </i>" +
            "</div>",
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////



            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
            "<div>" +
                "Информируем, что ‘ФИО того, кто внес комментарий’ оставил(а) комментарий в задаче ‘Наименование задачи’." +
                "Заполнение SMART-задач доступно по ссылке:" +
                    "<a href= \"https://10.117.11.77:44370/Account/LogOut\" target = \"blanc\">Посмотреть задачу можно по ссылке<a/>" +
                    "<br>" +
                    "<div>"+"или через ярлык на рабочем столе"+"<div>" +
                    "<span style=\"width:50px; height:50px;\">" +
                            "<img style=\"width:50px; height:50px;\" src='cid:{0}'>" +
                    "</span>" +
            "</div>"         
            ///////////////////////////////////////////////////////////////////////////////////////////////////////////
        };
        }
    }
}
